package main

/*

Derived types
ประเภทข้อมูลที่ได้มาจากการแปลงในภาษา Go คือการขยายความสามารถของประเภทข้อมูลพื้นฐานเพื่อสร้างโครงสร้างข้อมูลใหม่ๆ ที่มีความซับซ้อนและเฉพาะเจาะจงมากขึ้น ได้แก่:

โครงสร้าง (Structures): รวมข้อมูลหลายประเภทเข้าด้วยกัน
ฟังก์ชัน (Functions): กำหนดการทำงานหรือการดำเนินการ
สไลซ์ (Slices): ชุดข้อมูลที่ขนาดสามารถเปลี่ยนแปลงได้
อินเทอร์เฟซ (Interfaces): กำหนดชุดเมธอดที่ประเภทข้อมูลต้องการใช้งาน
แมพ (Maps): จัดเก็บข้อมูลในรูปแบบคีย์และค่า
ชาแนล (Channels): สำหรับการสื่อสารระหว่างกอรูทีน

*/

// ประเภทโครงสร้าง
type Person struct {
	Name string
	Age int
}

func main() {
   
	
	
}
