package main

import "fmt"

/*
การประกาศอาร์เรย์โดยใช้คีย์เวิร์ด var จะต้องระบุชื่อ, ขนาด และชนิดข้อมูลของอาร์เรย์ โดยมีรูปแบบ ดังนี้

var array_name[length]Type
ตัวอย่างเช่น var team [15]int จะประกาศอาร์เรย์ชื่อ team ที่สามารถเก็บข้อมูลจำนวนเต็มได้ 15 ค่า โดยใช้ index ตั้งแต่ team[0] ถึง team[14]

หากพยายามเข้าถึง index ที่อยู่นอกขอบเขตของอาร์เรย์ จะเกิด error ขึ้นในขั้นตอนการคอมไพล์หรือรันไทม์

ในตัวอย่างด้านล่างจะแสดงการประกาศอาร์เรย์ขนาด 5 และแสดงผลค่าในอาร์เรย์
*/

func main() {
	var x [5]int
	fmt.Println(x)
}

/*
ในตัวอย่างข้างต้น เราประกาศอาร์เรย์ x ที่มีขนาด 5 และชนิดข้อมูลเป็น int โดยใช้คีย์เวิร์ด var

เนื่องจากเรายังไม่ได้กำหนดค่าให้กับอาร์เรย์ x ดังนั้นสมาชิกในอาร์เรย์จะมีค่าเริ่มต้นเป็น zero value ตามชนิดข้อมูลของอาร์เรย์ ซึ่งในที่นี้เป็น 0 (สำหรับชนิดข้อมูล int)

เมื่อเรียกใช้คำสั่ง fmt.Println(x) จะแสดงผลค่าในอาร์เรย์ x ออกมาเป็น [0 0 0 0 0] ซึ่งเป็นค่าเริ่มต้นของอาร์เรย์ที่ยังไม่ได้กำหนดค่าให้กับสมาชิก
*/