package main

import "fmt"

/*
	ในภาษา Go สามารถเริ่มต้น (initialize) map ได้ 2 วิธี คือการใช้ map literal หรือใช้ built-in function make()
	การเริ่มต้น map โดยใช้ map literal เป็นวิธีที่ง่ายที่สุดในการสร้าง map ที่มีข้อมูลบางส่วนอยู่แล้ว โดยเราเพียงแค่ใส่คู่ key-value ที่คั่นด้วยเครื่องหมายโคลอน (:) ภายในวงเล็บปีกกา ({}) และต้องมีเครื่องหมายจุลภาค (,) ตามหลังคู่ key-value ตัวสุดท้ายเสมอ ไม่เช่นนั้นจะเกิด compiler error
	นอกจากนี้ เรายังสามารถสร้าง empty map (map ว่างเปล่า) โดยใช้ map literal ได้ โดยปล่อยวงเล็บปีกกาให้ว่างเปล่า
*/

func main() {
	var m1 = map[string]int {
		"a": 10,
		"b": 20,
		"c": 30,
		"d": 40,
		"e": 50,
	}
	fmt.Println(m1)
}
/* 
- ประกาศตัวแปร `m1` เป็น map ที่มี key เป็น string และ value เป็น int โดยใช้ map literal
- กำหนดคู่ key-value ให้กับ `m1` ดังนี้:
  - key "a" มีค่า 10
  - key "b" มีค่า 20
  - key "c" มีค่า 30
  - key "d" มีค่า 40
  - key "e" มีค่า 50
- แสดงค่าของ `m1` ออกมา

ผลลัพธ์ของโปรแกรมนี้จะเป็น:

```
map[a:10 b:20 c:30 d:40 e:50]
```

ซึ่งแสดงให้เห็นว่า `m1` ถูกเริ่มต้นด้วยคู่ key-value ตามที่กำหนดโดยใช้ map literal และพร้อมสำหรับการใช้งานแล้ว
*/