package main

import (
	"fmt"
)

/*
defer เป็นกลไกในภาษา Go ที่ช่วยเลื่อนการเรียกใช้ฟังก์ชันออกไปจนกว่าฟังก์ชันที่ครอบอยู่จะทำงานเสร็จสิ้น ไม่ว่าจะเป็นการจบการทำงานแบบปกติหรือผ่านการเกิด panic defer มักใช้เพื่อลดความซับซ้อนของฟังก์ชันที่ต้องทำงานทำความสะอาดต่างๆ หลังจากเสร็จสิ้นการทำงานหลัก

ภายในฟังก์ชัน `main()`:
   - เรียกใช้ `defer fmt.Println("GO")` ซึ่งจะเลื่อนการแสดงผลข้อความ "GO" ออกไปจนกว่าฟังก์ชัน `main()` จะทำงานเสร็จสิ้น
   - เรียกใช้ `fmt.Println("Book")` เพื่อแสดงผลข้อความ "Book" ทันที
5. เมื่อฟังก์ชัน `main()` ทำงานเสร็จสิ้น ข้อความที่ถูกเลื่อนด้วย `defer` จะถูกแสดงผลตามลำดับที่ถูกเรียกใช้ ในที่นี้คือ "GO"

*/


func main() {
	defer fmt.Println("GO")
	fmt.Println("Book")
}