package main

import "fmt"

/*
ในภาษา Go เราสามารถใช้ตัวดำเนินการ == เพื่อตรวจสอบว่า slice เป็น nil หรือไม่ โดยถ้า slice เป็น nil ผลการเปรียบเทียบจะเป็น true แต่ถ้า slice ไม่เป็น nil ผลการเปรียบเทียบจะเป็น false
*/

func main() {
	// creating slices
	s1 := []int{1, 2, 3, 4, 5}
	var s2 []int

	// Check if slice is nil or not
	fmt.Println(s1 == nil)
	fmt.Println(s2 == nil)

}

/* 
ในโปรแกรมนี้ เราสร้าง slice s1 โดยใช้ slice literal และกำหนดค่าเริ่มต้นเป็น {1, 2, 3, 4, 5} และสร้าง slice s2 โดยใช้การประกาศตัวแปรแบบ var โดยไม่ได้กำหนดค่าเริ่มต้น ซึ่งจะเป็น zero value slice

จากนั้น เราใช้ตัวดำเนินการ == เพื่อตรวจสอบว่า slice s1 และ s2 เป็น nil หรือไม่ โดยเปรียบเทียบกับ nil

จากผลลัพธ์ จะเห็นได้ว่าเมื่อเปรียบเทียบ slice s1 กับ nil ผลลัพธ์เป็น false เนื่องจาก s1 ไม่เป็น nil slice เพราะมีการกำหนดค่าเริ่มต้นให้กับ slice แล้ว

ในขณะที่เมื่อเปรียบเทียบ slice s2 กับ nil ผลลัพธ์เป็น true เนื่องจาก s2 เป็น nil slice หรือ zero value slice ที่ไม่มีการกำหนดค่าเริ่มต้น

โปรแกรมนี้แสดงให้เห็นถึงวิธีการตรวจสอบว่า slice เป็น nil หรือไม่โดยใช้ตัวดำเนินการ == ในภาษา Go ซึ่งเป็นประโยชน์ในการตรวจสอบสถานะของ slice ก่อนทำการดำเนินการใดๆ กับ slice นั้น
*/