package main

import "fmt"

/*
อาร์เรย์ (Array) คือ ชนิดข้อมูลที่ใช้เก็บข้อมูลชนิดเดียวกันหลายๆ ค่าไว้ในตัวแปรเดียว โดยในภาษา Go นั้น อาร์เรย์จะมีขนาดคงที่ (fixed length) ซึ่งเมื่อกำหนดขนาดแล้วจะไม่สามารถเปลี่ยนแปลงได้ แต่สามารถแก้ปัญหานี้ได้โดยใช้ slices ซึ่งจะกล่าวถึงในบทต่อไป

การประกาศอาร์เรย์ในภาษา Go จำเป็นต้องระบุขนาดของอาร์เรย์ และเมื่อกำหนดขนาดแล้วจะไม่สามารถเปลี่ยนแปลงได้ สมาชิกในอาร์เรย์สามารถเข้าถึงได้โดยใช้ตัวดำเนินการ [] และระบุตำแหน่ง (index) ของสมาชิกที่ต้องการ โดยเริ่มจาก 0 ไปจนถึง len(array)-1
*/



func main() {
	// ประกาศอาร์เรย์ที่มีขนาด 5 และชนิดข้อมูลเป็น int
	var numbers [5]int
	// กำหนดค่าให้กับสมาชิกในอาร์เรย์
	numbers[0] = 10
	numbers[1] = 20
	numbers[2] = 30
	numbers[3] = 40
	numbers[4] = 50

	// แสดงค่าสมาชิกในอาร์เรย์
	fmt.Println(numbers[0]) // ผลลัพธ์: 10
	fmt.Println(numbers[1]) // ผลลัพธ์: 20
	fmt.Println(numbers[2]) // ผลลัพธ์: 30
	fmt.Println(numbers[3]) // ผลลัพธ์: 40
	fmt.Println(numbers[4]) // ผลลัพธ์: 50
	// วนลูปแสดงค่าสมาชิกในอาร์เรย์
	for i := 0; i < len(numbers); i++ {
		fmt.Println(numbers[i])
	}
}

/*
ในตัวอย่างข้างต้น เราประกาศอาร์เรย์ numbers ที่มีขนาด 5 และชนิดข้อมูลเป็น int จากนั้นกำหนดค่าให้กับสมาชิกในอาร์เรย์โดยใช้ตัวดำเนินการ [] และระบุตำแหน่งของสมาชิกที่ต้องการ

เราสามารถแสดงค่าสมาชิกในอาร์เรย์ได้โดยใช้คำสั่ง fmt.Println() และระบุตำแหน่งของสมาชิกที่ต้องการ นอกจากนี้ยังสามารถใช้ loop for เพื่อวนลูปแสดงค่าสมาชิกในอาร์เรย์ได้อีกด้วย
*/