package main

import "fmt"

/*
สรุปสั้นๆ เกี่ยวกับพารามิเตอร์และการคืนค่าในฟังก์ชันของภาษา Go
1. ฟังก์ชันสามารถรับพารามิเตอร์เพื่อนำไปใช้ในการประมวลผลภายในฟังก์ชันได้
2. พารามิเตอร์ทำหน้าที่เป็นตัวแปรที่รับค่าจากภายนอกฟังก์ชัน
3. ฟังก์ชันสามารถคืนค่ากลับไปยังส่วนที่เรียกใช้ฟังก์ชันได้ โดยใช้คำสั่ง `return`
4. การระบุชนิดข้อมูลของค่าที่คืนจากฟังก์ชันทำได้โดยการใส่ชนิดข้อมูลหลังรายการพารามิเตอร์
5. ฟังก์ชันบางฟังก์ชันอาจไม่จำเป็นต้องคืนค่าก็ได้
*/


func main() {
	/* การใช้ := เป็นวิธีที่สะดวกและกระชับในการประกาศตัวแปรและกำหนดค่าเริ่มต้นในบรรทัดเดียวกัน โดยไม่จำเป็นต้องระบุชนิดข้อมูลของตัวแปร เพราะ Go สามารถอนุมานชนิดข้อมูลได้จากค่าที่กำหนดให้ */
	x := 50
	y := 40
	/* เรียกฟังก์ชันเพื่อหาผลรวมของค่า */
	sum_value := sum(x, y)
	fmt.Printf("Sum value is: %d\n", sum_value)

}

/* ฟังก์ชันที่คืนค่าผลรวมของสองจำนวน */
func sum(num1, num2 int) int {
	/* ประกาศตัวแปรท้องถิ่น */
	result := num1 + num2
	return result
}