package main

import "fmt"

/*
Go เมื่อเราดึงค่าที่กำหนดให้กับ key โดยใช้รูปแบบ map[key] นอกจากจะคืนค่าแล้ว มันยังคืนค่า Boolean เพิ่มเติมอีกด้วย ซึ่งจะเป็น true ถ้า key มีอยู่ในแมป และเป็น false ถ้าไม่มีอยู่
เราสามารถตรวจสอบการมีอยู่ของ key ในแมปได้โดยใช้การกำหนดค่าสองค่าดังนี้:
*/

func main() {
	// value, variable_name := map_name[key]
	/* 
	ตัวแปร Boolean จะเป็น true ถ้า key มีอยู่ และเป็น false ถ้าไม่มีอยู่
	ถ้าเราต้องการเพียงแค่ตรวจสอบการมีอยู่ของ key โดยไม่ต้องการดึงค่าที่เกี่ยวข้องกับ key นั้น เราสามารถใช้ _ (underscore) แทนค่าแรกได้ ดังนี้:
	_, variable_name := map_name[key]
	*/
	 // สร้างและกำหนดค่าเริ่มต้นให้กับแมป
	 var my_map = map[int]string {
		1: "US",
		91: "India",
		86: "China",
		44: "UK",
	 }

	 fmt.Println("Original Map:", my_map)
	 // ตรวจสอบว่า key มีอยู่ในแมปหรือไม่
	 country, x := my_map[91]
	 fmt.Println("\nKey present or not:", x)
	 fmt.Println("Value:", country)
	 // ใช้ blank identifier เพื่อตรวจสอบการมีอยู่ของ key โดยไม่ต้องการค่า
	 _, y := my_map[95]
	 fmt.Println("\nKey 95 present or not:", y)
}

/* 
1. เราสร้างแมป `my_map` และกำหนดค่าเริ่มต้นให้กับแมปโดยใช้ `map[int]string` ซึ่งหมายความว่า key เป็นชนิด `int` และ value เป็นชนิด `string`
2. เราพิมพ์แมปเดิมออกมาโดยใช้ `fmt.Println("Original Map:", my_map)`
3. เราตรวจสอบว่า key `91` มีอยู่ในแมปหรือไม่โดยใช้ `country, x := my_map[91]`
   - ถ้า key `91` มีอยู่ `x` จะเป็น `true` และ `country` จะมีค่าเท่ากับ value ของ key `91` ซึ่งก็คือ `"India"`
   - เราพิมพ์ค่าของ `x` และ `country` ออกมาโดยใช้ `fmt.Println()`
4. เราใช้ blank identifier `_` เพื่อตรวจสอบการมีอยู่ของ key `95` โดยไม่ต้องการค่าโดยใช้ `_, y := my_map[95]`
   - ถ้า key `95` มีอยู่ `y` จะเป็น `true` แต่ถ้าไม่มีอยู่ `y` จะเป็น `false`
   - เราพิมพ์ค่าของ `y` ออกมาโดยใช้ `fmt.Println()`


จากผลลัพธ์จะเห็นได้ว่าเมื่อเราตรวจสอบการมีอยู่ของ key `91` ซึ่งมีอยู่ในแมป เราจะได้ค่า `true` และค่าที่เกี่ยวข้องกับ key นั้นคือ `"India"` แต่เมื่อเราตรวจสอบการมีอยู่ของ key `95` ซึ่งไม่มีอยู่ในแมป เราจะได้ค่า `false`

นี่เป็นวิธีการตรวจสอบการมีอยู่ของ key ในแมปอย่างง่ายดายโดยใช้การกำหนดค่าสองค่า `value, variable_name := map_name[key]` หรือใช้ blank identifier `_` ถ้าเราต้องการเพียงแค่ตรวจสอบการมีอยู่ของ key โดยไม่ต้องการค่า
*/