package main

import "fmt"

/*
named returns
ใน Golang เราสามารถตั้งชื่อให้กับพารามิเตอร์ที่ฟังก์ชันจะคืนค่ากลับได้เลยตั้งแต่ตอนประกาศฟังก์ชัน เรียกว่า "named returns" ซึ่งจะช่วยให้ไม่ต้องระบุชื่อตัวแปรอีกครั้งตอนที่เขียน return statement โดยเทคนิคนี้มักจะใช้เวลาที่ฟังก์ชันต้องการคืนค่ากลับหลายค่า ซึ่งช่วยอำนวยความสะดวกให้กับผู้ใช้และทำให้โค้ดอ่านง่ายขึ้น

โดยปกติแล้วเวลาเขียนฟังก์ชันที่ต้องการคืนค่า เราจะประกาศแค่ชนิดข้อมูลที่จะคืนกลับ เช่น
func sum(a, b int) int {
    return a + b
}

แต่ด้วย named returns เราสามารถประกาศตัวแปรที่จะใช้เก็บค่าที่จะ return ไปพร้อมกับชนิดข้อมูลเลย ตรงวงเล็บหลังรายการพารามิเตอร์ของฟังก์ชัน
func sum(a, b int) (add int) { ... }

ซึ่ง add ก็จะกลายเป็นตัวแปรในฟังก์ชันนั้นๆ ที่เราสามารถกำหนดค่าให้มันได้
*/

// ฟังก์ชันที่ใช้ named returns
func sum(a, b int) (add int) {
	add = a + b
	// ไม่จำเป็นต้องระบุพารามิเตอร์ตอน return
	return
}

func main() {
	// เรียกใช้ฟังก์ชัน sum ที่คืนค่ากลับมาหนึ่งค่า
	x := sum(10, 20)
	fmt.Println("10 + 20 = ", x)
}