package main

import "fmt"

/*
คำสั่งควบคุมลูป (Loop control statements) ใช้สำหรับเปลี่ยนแปลงการทำงานของโปรแกรม เมื่อการทำงานของลูปออกจากขอบเขตของมัน วัตถุที่ถูกสร้างภายในขอบเขตนั้นจะถูกทำลายไปด้วย ภาษา Go รองรับคำสั่งควบคุมลูป 3 ประเภท ได้แก่ break, goto และ continue


*/

func main() {
	// i := 0
	// Here:
	// 	fmt.Println(i)
	// 	i++
	// 	if i < 5 {
	// 		goto Here
	// 	}
		/* 
		ดังนั้น ถึงแม้ว่าโค้ดนี้จะไม่มีโครงสร้างลูปแบบปกติ แต่ก็สามารถสร้างการทำงานแบบลูปได้โดยใช้คำสั่ง goto เพื่อกระโดดกลับไปยังจุดเริ่มต้นของลูปเมื่อเงื่อนไขเป็นจริง
		*/

	// คำสั่ง break
	// for i := 0; i < 5; i++ {
	// 	if i == 3 {
	// 		break
	// 	}
	// 	fmt.Println(i)
	// }
	/* 
	คำสั่ง break ใช้สำหรับหยุดการทำงานของลูปทันที เมื่อเงื่อนไขเป็นจริง
	ในตัวอย่างนี้ เมื่อ i มีค่าเท่ากับ 3 คำสั่ง break จะถูกเรียกใช้ และลูปจะหยุดการทำงานทันที
	*/
	// คำสั่ง continue
	for i := 0; i < 5; i++ {
		if i == 3 {
			continue
		}
		fmt.Println(i)
	}
	/* 
	คำสั่ง continue ใช้สำหรับข้ามการทำงานในรอบปัจจุบันของลูป และเริ่มต้นรอบถัดไปทันที
ในตัวอย่างนี้ เมื่อ i มีค่าเท่ากับ 3 คำสั่ง continue จะถูกเรียกใช้ และโปรแกรมจะข้ามการทำงานในรอบนั้น แล้วเริ่มต้นรอบถัดไป
	*/
}