package main

import "fmt"

/*
ตัวดำเนินการทางตรรกะ อ้างอิงตารางต่อไปนี้:

&& ตัวดำเนินการ AND ทางตรรกะ
|| ตัวดำเนินการ OR ทางตรรกะ
! เรียกว่าตัวดำเนินการ NOT ทางตรรกะ และใช้เพื่อกลับสถานะตรรกะของ operand หากเงื่อนไขเป็นจริง ตัวดำเนินการ NOT ทางตรรกะจะทำให้เป็นเท็จ

*/

func main() {
	var a int = 10
	var b int = 20
	// ตัวดำเนินการ AND ทางตรรกะ
	if a != b && a <= b {
		fmt.Println("True") // แสดง "True"
	}
	// ตัวดำเนินการ OR ทางตรรกะ
	if a != b || a <= b {
		fmt.Println("true") // แสดง "True"
	}
	// ตัวดำเนินการ NOT ทางตรรกะ
	if !(a == b) {
		fmt.Println("true") // แสดง "True"
	}
}
