package main

import "fmt"

/*
ในภาษา Go, array เป็นชุดข้อมูลที่มีขนาดคงที่และเก็บข้อมูลประเภทเดียวกัน โดยข้อมูลจะถูกเก็บตามลำดับและสามารถเข้าถึงได้ด้วยดัชนี (index) เมื่อกำหนดขนาดของ array แล้ว จะไม่สามารถขยายขนาดเพิ่มเติมได้ Go เป็นภาษาที่มีการกำหนดชนิดข้อมูลแบบคงที่ (statically typed) จึงไม่อนุญาตให้ใส่ข้อมูลต่างประเภทกันใน array เดียวกัน

*/

func main() {
	// การประกาศ Array
	var arr [5]int
	// ประกาศตัวแปร arr เป็น array ของจำนวนเต็ม (int) ขนาด 5 ช่อง
	// arr = [5]int{1, 2, 3, 4, 5}
	// กำหนดค่าให้กับ array arr ด้วย array literal {1, 2, 3, 4, 5}

	arr = [...]int{1, 2, 3, 4, 5}
	// ใช้ ... แทนการระบุขนาด array และให้ Go คำนวณขนาดจากจำนวนข้อมูลที่กำหนด

	arr[0] = 10  // กำหนดค่า 10 ให้ index 0
	// value := arr[2] // เข้าถึงค่าที่ index 2

	// var arr2 = [2][3]int | ประกาศ array 2 มิติ ขนาด 2 แถว 3 คอลัมน์
    
	// การวนลูปใน Array
	for i := 0; i < len(arr); i++ {
		fmt.Println(arr[i])
	}
	// ใช้ loop for เพื่อวนเข้าถึงข้อมูลใน array ตามลำดับ index
	/* 
		การส่ง Array เป็นพารามิเตอร์ในฟังก์ชัน
		func printArray(arr [5]int) {
			
		}
		ระบุขนาดของ array ในพารามิเตอร์ของฟังก์ชัน
	*/

	// fmt.Println(arr)
	// fmt.Println(value)
}

/*

*/