package main

import (
	"fmt"
)

/*
ตัวดำเนินการเปรียบเทียบกับพอยน์เตอร์ในภาษา Go ได้ แต่ไม่สามารถใช้ตัวดำเนินการทางคณิตศาสตร์หรือตัวดำเนินการอื่นๆ กับพอยน์เตอร์ได้ การเปรียบเทียบพอยน์เตอร์จะเปรียบเทียบที่อยู่ที่พอยน์เตอร์ชี้ไปว่าเหมือนกันหรือไม่ ไม่ได้เปรียบเทียบค่าของข้อมูลที่พอยน์เตอร์ชี้ไป
*/

func main() {
    x := 10
    y := 20
    
    a := &x
    b := &y
    
    fmt.Println(a == b)  // เปรียบเทียบพอยน์เตอร์ a และ b ว่าชี้ไปที่ที่อยู่เดียวกันหรือไม่
    fmt.Println(a != b)  // เปรียบเทียบพอยน์เตอร์ a และ b ว่าชี้ไปที่ที่อยู่ต่างกันหรือไม่
    
    c := &x
    
    fmt.Println(a == c)  // เปรียบเทียบพอยน์เตอร์ a และ c ว่าชี้ไปที่ที่อยู่เดียวกันหรือไม่
}
/* 

*/