package main

import (
	"fmt"
)

/*
ในภาษา Go ค่าคงที่ (constants) เป็นตัวแปรที่มีค่าที่รู้จักตั้งแต่เวลาคอมไพล์และไม่สามารถเปลี่ยนแปลงค่าได้ตลอดการทำงานของโปรแกรม เราสามารถประกาศค่าคงที่ได้โดยใช้คำสั่ง const
ในตัวอย่างโค้ด จะแสดงการประกาศค่าคงที่ x ด้วยค่า 1000 และการประกาศค่าคงที่หลายตัวพร้อมกันโดยใช้ const () ซึ่งประกาศค่าคงที่ y เป็น 1.2 และ z เป็น 10
จากนั้นใช้ฟังก์ชัน fmt.Println() เพื่อแสดงค่าของค่าคงที่ x, y และ z
*/

func main() {
	// ประกาศค่าคงที่ x ด้วยค่า 1000
	const x = 1000

	// ประกาศค่าคงที่หลายตัวพร้อมกัน
	const (
		y = 1.2 // ประกาศค่าคงที่ y เป็น 1.2
		z = 10  // ประกาศค่าคงที่ z เป็น 10
	)

	// แสดงค่าของค่าคงที่ x, y และ z
	fmt.Println(x, y, z)
}

/*

 */
