package main

import (
	"fmt"
)

/*
โค้ดนี้แสดงวิธีการเข้าถึงข้อมูลในแมป (map) ของ Go และวิธีการตรวจสอบว่ามีคีย์ (key) ในแมปหรือไม่ โดยมีรายละเอียดดังนี้

1. การเข้าถึงค่าในแมปสามารถทำได้โดยใช้คีย์ที่ตรงกับค่านั้นในวงเล็บเหลี่ยม เช่น m[1] จะให้ค่า "Udit"

2. เมื่อเข้าถึงค่าในแมปด้วยคีย์ จะได้ค่ากลับมา 2 ค่า คือ ค่าที่ต้องการ และค่าบูลีนที่บอกว่ามีคีย์นั้นในแมปหรือไม่

3 เราสามารถตรวจสอบว่ามีคีย์ในแมปหรือไม่ได้โดยดูค่าบูลีนที่ได้กลับมาจากการเข้าถึงค่าในแมป
*/

func main() {
	// สร้างแมปที่มีคีย์เป็นจำนวนเต็มและค่าเป็นสตริง
	m := map[int]string{1: "Udit", 2: "Raju"}
	// แสดงค่าในแมปโดยใช้คีย์ 1 และ 2
	fmt.Println(m[1], m[2])
	// Output: Udit Raju
	// ลองเข้าถึงค่าในแมปด้วยคีย์ที่ไม่มี (3)
	// จะได้ค่ากลับมา 2 ค่า คือ ค่าว่างสำหรับค่าแรก และค่า false สำหรับค่าที่สอง
	data, itExists := m[3]
	fmt.Println(data, itExists)
	// Output: false
	// ตรวจสอบว่ามีคีย์ในแมปหรือไม่ก่อนใช้ค่า
	data, itExists = m[3]
	if itExists {
		fmt.Println(data)
	} else {
		fmt.Println("the data does not exists")
	}
	// Output: the data does not exists
}

/*
โค้ดนี้ทำงานโดยการสร้างแมปที่มีคีย์เป็นจำนวนเต็มและค่าเป็นสตริง จากนั้นแสดงค่าในแมปโดยใช้คีย์ 1 และ 2 ต่อมาลองเข้าถึงค่าในแมปด้วยคีย์ที่ไม่มี (3) และแสดงค่าที่ได้กลับมา ซึ่งจะเป็นค่าว่างสำหรับค่าแรกและค่า false สำหรับค่าที่สอง สุดท้ายตรวจสอบว่ามีคีย์ในแมปหรือไม่ก่อนใช้ค่า โดยใช้ค่าบูลีนที่ได้กลับมาจากการเข้าถึงค่าในแมป
*/
