package main

import (
	"fmt"
)

/*
แสดงวิธีการวนลูปผ่าน Array โดยใช้คีย์เวิร์ด range ในภาษา Go เพื่อดึงค่า index และ value ของแต่ละ element ใน Array ออกมา
*/

func Array_Iterate_Array_Using_Range() {
	// ประกาศ Array ชื่อ x ที่มีสมาชิกเป็นตัวเลขจำนวนเต็ม 5 ตัว
	x := [...]int{23, 4, 32, 5, 76}

	// ใช้ range เพื่อวนลูปผ่าน Array x
	// ในแต่ละรอบ i จะเก็บ index ปัจจุบัน และ v จะเก็บ value ของ element ที่ index นั้น
	for i, v := range x {
		// แสดงค่า index และ value ของแต่ละ element ใน Array
		fmt.Println(i, v)
	}
}

func main() {
	Array_Iterate_Array_Using_Range()
}

/*
เมื่อใช้ `...` ในการประกาศ Array แบบนี้ มันหมายความว่าให้ Go compiler กำหนดขนาดของ Array อัตโนมัติตามจำนวนสมาชิกที่เรากำหนด ในกรณีนี้ Go จะสร้าง Array ที่มีขนาด 5 เพราะเรากำหนดสมาชิกมา 5 ตัว

การใช้ `...` ในลักษณะนี้เรียกว่า "inferred length" หรือการอนุมานขนาดอัตโนมัติ มันช่วยให้เราไม่ต้องกำหนดขนาดของ Array เองแบบ `[5]int` แต่ให้ Go อนุมานขนาดให้อัตโนมัติตามจำนวนสมาชิกที่เรากำหนด ทำให้สะดวกในการประกาศ Array ที่มีขนาดตามจำนวนสมาชิกที่ต้องการนั่นเอง
*/
