package main

import (
	"fmt"
	"time"
)

/*
โปรแกรมนี้สร้าง goroutines สองตัวโดยเรียกฟังก์ชัน f1 สองครั้งพร้อมกัน แต่ละ goroutine จะพิมพ์ชื่อ (F1 หรือ F2) และดัชนีของลูปจาก 0 ถึง 9 โดยหยุดพักเป็นเวลา 1 วินาทีในแต่ละรอบ อย่างไรก็ตาม ฟังก์ชัน main หยุดพักเพียง 5 วินาที ดังนั้นมันจะไม่รอให้ goroutines ทำงานจนเสร็จสมบูรณ์ก่อนที่จะจบโปรแกรม ทำให้ผลลัพธ์ที่ได้อาจไม่ครบถ้วนและไม่สามารถคาดเดาได้
*/

func f1(name string) {
	// ฟังก์ชัน f1 รับพารามิเตอร์ name เป็นสตริง
	for i := 0; i < 10; i++ {
		// ลูป for วนซ้ำ 10 ครั้งตั้งแต่ 0 ถึง 9
		fmt.Println(name, ":", i)
		// พิมพ์ค่า name และ i ของแต่ละรอบลูป
		time.Sleep(time.Second)
		// หยุดพักเป็นเวลา 1 วินาที
	}
}

func main() {

	// ฟังก์ชัน main เป็นจุดเริ่มต้นของโปรแกรม
	go f1("F1")
	// เรียกฟังก์ชัน f1 เป็น goroutine โดยส่ง "F1" เป็นอาร์กิวเมนต์
	go f1("F2")
	// เรียกฟังก์ชัน f1 เป็น goroutine โดยส่ง "F2" เป็นอาร์กิวเมนต์
	time.Sleep(time.Second * 5)
	// ฟังก์ชัน main หยุดพักเป็นเวลา 5 วินาที เพื่อให้ goroutines มีเวลาทำงาน
	fmt.Println("Main Terminated")
	// พิมพ์ข้อความ "Main Terminated" เมื่อฟังก์ชัน main จบการทำงาน

}

/*

 */
