package main

import "fmt"

/*
หาปัญหาในโปรแกรมต่อไปนี้

ปัญหาคือในฟังก์ชัน main การเรียกใช้ b.m1() จะทำให้เกิดข้อผิดพลาดในการคอมไพล์ เพราะ m1 ใน B คาดหวังพารามิเตอร์หนึ่งตัวของประเภท int แต่ในการเรียกใช้ไม่ได้ส่งอาร์กิวเมนต์ใดๆ เลย วิธีแก้ไขคือเพิ่มอาร์กิวเมนต์ให้ตรงกับที่เมธอด m1 ของ B คาดหวัง เช่น b.m1(42)
*/
type A struct{}

func (a A) m1() {
    fmt.Println("M1 of A")
}

type B struct {
    A
}

func (b B) m1(a int) {
    fmt.Println("M1 of B")
}

func main() {
    b := B{}
    b.m1()
}
/* 

*/