package main

import (
	"fmt"
)

/*
เกี่ยวกับ ASCII, Unicode และสตริงในภาษา Go:

1. ASCII เป็นรหัสมาตรฐาน 8 บิตที่ใช้แทนอักขระ แต่มีข้อจำกัดในการแทนอักขระที่หลากหลาย
2. Unicode เป็นรหัสอักขระ 32 บิตที่สามารถแทนอักขระได้หลากหลายมากขึ้น
3. UTF-8 เป็นรหัสย่อยของ Unicode ที่มีความยาว 8 ไบต์และสามารถขยายได้ถึง 32 ไบต์
4. ในภาษา Go สตริงเป็นลำดับของไบต์ที่ใช้แทนอักขระต่างๆ โดยใช้รหัส UTF-8
5. อักขระแต่ละตัวในสตริงของภาษา Go เรียกว่า Rune ซึ่งเป็นอักขระ UTF-8
6. สตริงในภาษา Go เป็นแบบอ่านอย่างเดียวและไม่สามารถแก้ไขได้โดยตรง การแก้ไขสตริงจะสร้างสตริงใหม่ขึ้นมาแทน

ภาษา Go ใช้ UTF-8 ในการแทนอักขระในสตริง ซึ่งช่วยให้สามารถจัดการกับอักขระที่หลากหลายได้อย่างมีประสิทธิภาพ โดยแต่ละอักขระในสตริงจะถูกแทนด้วย Rune ที่เป็นรหัส UTF-8
*/

func main() {
    x := "Hi Udit"
    fmt.Println(x)
    // each character "H, i, U, d, i, t" will be represented as a rune
}
/* 

*/