package main

import (
	"fmt"
)

/*
แสดงให้เห็นถึงการสร้างฟังก์ชันในภาษา Go โดยใช้คีย์เวิร์ด func ชื่อฟังก์ชันคือ Give_Greetings ซึ่งรับพารามิเตอร์ชื่อประเภทสตริง และส่งคืนค่าประเภทสตริงเช่นกัน ภายในฟังก์ชันจะทำการรวมสตริงคำว่า "Hi" กับพารามิเตอร์ชื่อที่ส่งเข้ามา แล้วส่งค่ากลับไป
การใช้ฟังก์ชันมีจุดประสงค์หลักเพื่อให้สามารถนำโค้ดไปใช้ซ้ำได้ และให้ความสามารถในการเรียกใช้ได้จากที่ต่างๆ ภายในแพคเกจหรือจากภายนอกแพคเกจ ฟังก์ชันยังให้ความสามารถในการซ่อนรายละเอียดการทำงานภายในจากผู้ใช้งาน ผู้ใช้งานเพียงแค่ต้องรู้ชื่อฟังก์ชัน พารามิเตอร์ที่ต้องส่งเข้าไป และชนิดของค่าที่จะได้รับกลับมา
*/

// ประกาศฟังก์ชันชื่อ Give_Greetings
// รับพารามิเตอร์ name ประเภท string
// และส่งคืนค่าประเภท string
func Give_Greetings(name string) string {
	// รวมสตริง "Hi" กับ name ที่ส่งเข้ามาเป็นพารามิเตอร์
	// และส่งคืนค่าสตริงที่ได้
	return "Hi" + " " + name
}

func main() {
	// เรียกใช้ฟังก์ชัน Give_Greetings พร้อมส่งค่า "Raju" เข้าไปเป็นพารามิเตอร์
	// และแสดงผลลัพธ์ที่ได้รับกลับมา
	fmt.Println(Give_Greetings("Raju"))
}

/*

 */
