package main

import (
	"fmt"
)

/*
แสดงวิธีการวนลูปเพื่ออ่านค่าจากแมป (map) ในภาษา Go โดยใช้คำสั่ง range ซึ่งจะคืนค่ากลับมาเป็นคีย์และค่าในแต่ละรอบของการวนลูป
*/

// ฟังก์ชันสำหรับวนลูปอ่านค่าจากแมป
func Iterate_Through_Map() {
	// สร้างแมปที่มีคีย์เป็นจำนวนเต็มและค่าเป็นสตริง
	m1 := map[int]string{1: "Udit", 2: "Raju", 3: "Akash"}

	// วนลูปอ่านค่าจากแมป
	// ในแต่ละรอบของการวนลูป key จะได้รับคีย์ และ val จะได้รับค่าที่ตรงกับคีย์นั้น
	for key, val := range m1 {
		// แสดงคีย์และค่าในแต่ละรอบของการวนลูป
		fmt.Println(key, val)
	}
}

func main() {
	Iterate_Through_Map()
}

/*
โค้ดนี้ทำงานโดยการสร้างฟังก์ชัน Iterate_Through_Map() ซึ่งภายในฟังก์ชันจะสร้างแมปที่มีคีย์เป็นจำนวนเต็มและค่าเป็นสตริง จากนั้นใช้คำสั่ง for key, val := range m1 เพื่อวนลูปอ่านค่าจากแมป m1 โดยในแต่ละรอบของการวนลูป ตัวแปร key จะได้รับคีย์ และตัวแปร val จะได้รับค่าที่ตรงกับคีย์นั้น ภายในลูปจะแสดงคีย์และค่าที่ได้ในแต่ละรอบ
*/
