package main

import (
	"fmt"
	"strconv"
)

/*
แพ็คเกจ strconv ในภาษา Go มีฟังก์ชันที่เป็นประโยชน์ในการแปลงสตริงเป็นประเภทข้อมูลอื่นๆ เช่น จำนวนเต็ม จำนวนจุดทศนิยม และบูลีน
*/

func main() {
	// แปลงสตริง "42" เป็นจำนวนเต็ม โดยระบุเลขฐานเป็น 10 และขนาดเป็น 64 บิต
	// i, err := strconv.ParseInt("42", 10, 64)

	// แปลงสตริง "3.14" เป็นจำนวนทศนิยม โดยระบุขนาดเป็น 64 บิต
	f, err := strconv.ParseFloat("3.14", 64)

	// ตรวจสอบว่าการแปลงสำเร็จหรือไม่
	if err != nil {
		// หากการแปลงล้มเหลว จะไม่แสดงค่าใดๆ
		fmt.Println(f)
	} else {
		// หากการแปลงสำเร็จ แสดงค่าจำนวนเต็มที่แปลงได้
		fmt.Println(f)
	}
}

/*

 */
