package main

import (
	"fmt"
)

/*
iota เป็นคำสงวนที่มีความสามารถพิเศษในการสร้างค่าคงที่แบบอนุกรมโดยอัตโนมัติ โดยไม่ต้องนำเข้าเป็น module หรือ package แยกต่างหาก และสามารถใช้ได้โดยตรงในบล็อกของ const
*/

func main() {
	// ประกาศประเภท Grades เป็น int
	type Grades int

	// ประกาศค่าคงที่ของเกรดนักเรียนโดยใช้ iota
	const (
		Akshay Grades = iota // ค่าเริ่มต้นของ Akshay เป็น 0
		Bhim                 // ค่าของ Bhim จะเพิ่มขึ้นเป็น 1 โดยอัตโนมัติ
		Chintu               // ค่าของ Chintu จะเพิ่มขึ้นเป็น 2 โดยอัตโนมัติ
		Dimri                // ค่าของ Dimri จะเพิ่มขึ้นเป็น 3 โดยอัตโนมัติ
	)

	// แสดงค่าของค่าคงที่ของเกรดนักเรียนแต่ละคน
	fmt.Println(Akshay, Bhim, Chintu, Dimri)
}

/*

 */
