package main

import (
	"fmt"
)

/*
Composite Data Type คือชนิดข้อมูลที่สามารถเก็บกลุ่มข้อมูลหรือค่าหลายค่าไว้ด้วยกัน ไม่ว่าจะเป็นชนิดข้อมูลเดียวกันหรือต่างกัน ในภาษา Go เราสามารถประกาศอาร์เรย์ได้โดยใช้คีย์เวิร์ด var ตามด้วย ขนาดของอาร์เรย์ และ ชื่อประเภท อาร์เรย์ เมื่อประกาศอาร์เรย์ ค่าเริ่มต้นของอาร์เรย์จะถูกกำหนดเป็น 0
*/

func Array_DeclareEmptyArray() {
	// ประกาศอาร์เรย์ a ขนาด 5 ช่อง ชนิด int
	var a [5]int
	// แสดงค่าของอาร์เรย์ a
	fmt.Println(a)
}

func main() {
	// เรียกใช้ฟังก์ชัน Array_DeclareEmptyArray
	Array_DeclareEmptyArray()
}
