package main

/*
ภาษา Go กระบวนการแก้ไขเมธอด (Method resolution process) ถูกใช้โดยคอมไพเลอร์เพื่อค้นหาเมธอดที่ถูกเรียกใช้ โดยจะค้นหาในประเภท (type) เดียวกันก่อน ถ้าไม่พบจะค้นหาในประเภทที่ถูกฝัง (embedded types) และประเภทที่ถูกฝังซ้อนกันไปเรื่อยๆ
ถ้าเมธอดเดียวกันถูกกำหนดในสองประเภทที่ถูกฝังในระดับเดียวกัน จะเกิดความกำกวม (ambiguity) และคอมไพเลอร์จะให้ข้อผิดพลาดในการคอมไพล์ ซึ่งสามารถแก้ไขได้โดยระบุประเภทที่ถูกฝังขณะเรียกใช้เมธอด
*/

type A struct {
    B
    C
}

type B struct {}
type C struct {}

func (b B) m1() {}

func (c C) m1() {}


func main() {
	a := A{}
    // a.m1() // error: ambiguous selector a.m1
    a.B.m1() // calls B's m1
    a.C.m1() // calls C's m1
}
/* 

*/