package main

/*
ภาษา Go กระบวนการแก้ไขเมธอด (Method resolution process) ถูกใช้โดยคอมไพเลอร์เพื่อค้นหาเมธอดที่ถูกเรียกใช้ โดยจะค้นหาในประเภท (type) เดียวกันก่อน ถ้าไม่พบจะค้นหาในประเภทที่ถูกฝัง (embedded types) และประเภทที่ถูกฝังซ้อนกันไปเรื่อยๆ
ถ้าเมธอดเดียวกันถูกกำหนดในสองประเภทที่ถูกฝังในระดับเดียวกัน จะเกิดความกำกวม (ambiguity) และคอมไพเลอร์จะให้ข้อผิดพลาดในการคอมไพล์ ซึ่งสามารถแก้ไขได้โดยระบุประเภทที่ถูกฝังขณะเรียกใช้เมธอด
*/

type A struct {
    B
    C
}

type B struct {
    D
}

type C struct {}
type D struct {}

func (c C) m1() {}
func (d D) m1() {}

func main() {
	a := A{}
    a.m1()  // calls C's m1 ไม่ Error เพราะ C ไม่ได้อยู่ระดับเดียวกันกับ D
    a.B.m1() // calls D's m1
}
/* 

*/