package main

import (
	"GoProject/module" // นำเข้าชื่อของ module ที่มีสตรักเจอร์ Person และ Address
	"fmt"
)

/*
แสดงวิธีการเข้าถึงข้อมูลจากสตรักเจอร์ (Struct) และวิธีการสร้างสตรักเจอร์และกำหนดค่าเริ่มต้นให้กับ ของสตรักเจอร์
*/

// ฟังก์ชันสำหรับเข้าถึงข้อมูลจากสตรักเจอร์
func Access_Data_From_Struct() {
	// สร้างออบเจ็กต์ Person
	p := module.Person{
		Name: "Udit",
		Age:  30,
		Address: module.Address{
			HouseNo: "A8",
			City:    "Delhi",
		},
	}

	// เข้าถึงข้อมูลในสนามของสตรักเจอร์ด้วยนอเทชัน .
	name := p.Name
	address := p.Address

	// แสดงข้อมูลที่เข้าถึงได้
	fmt.Println(name, address)
}

// ฟังก์ชันสำหรับสร้างสตรักเจอร์และกำหนดค่าเริ่มต้น
func Initialize_The_Struct_To_Default() {
	// สร้างสตรักเจอร์ Person และกำหนดค่าเริ่มต้นด้วยคีย์เวิร์ด new
	// คีย์เวิร์ด new จะสร้างหน่วยความจำสำหรับสตรักเจอร์และคืนค่าเป็นพอยเตอร์
	// *(new(Person)) จะเป็นการ dereference พอยเตอร์เพื่อให้ได้สตรักเจอร์ Person
	p := *(new(module.Person))

	// แสดงค่าของสตรักเจอร์ที่ถูกสร้างขึ้น
	// ซึ่งจะเป็นค่าเริ่มต้นของแต่ละสนาม (ค่าว่างสำหรับสตริงและ 0 สำหรับจำนวนเต็ม)
	fmt.Println(p)
}
func main() {
	// Access_Data_From_Struct()
	Initialize_The_Struct_To_Default()
}

/*
1. `Access_Data_From_Struct()` ทำงานโดยการสร้างออบเจ็กต์ `Person` และกำหนดค่าชื่อ อายุ และที่อยู่ จากนั้นเข้าถึงข้อมูลในสนามต่างๆ ของสตรักเจอร์ด้วยนอเทชัน `.` และแสดงข้อมูลที่เข้าถึงได้

2. `Initialize_The_Struct_To_Default()` ทำงานโดยการสร้างสตรักเจอร์ `Person` และกำหนดค่าเริ่มต้นให้กับสนามต่างๆ ด้วยคีย์เวิร์ด `new` จากนั้นแสดงค่าของสตรักเจอร์ที่ถูกสร้างขึ้น ซึ่งจะเป็นค่าเริ่มต้นของแต่ละสนาม (ค่าว่างสำหรับสตริงและ 0 สำหรับจำนวนเต็ม)
*/
