package main

import (
	"fmt"
	"unicode"
)

/*
ในภาษา Go มีแพ็คเกจ Unicode ที่มีฟังก์ชันต่างๆ สำหรับทำงานกับ Rune (อักขระ Unicode) โดยมีเมธอดหลายอย่าง เช่น IsLower() ที่ใช้ตรวจสอบว่าอักขระเป็นตัวพิมพ์เล็กหรือไม่
ในตัวอย่างโค้ด จะแสดงการใช้เมธอด IsLower() ในการตรวจสอบแต่ละอักขระในสตริง "Hello how are u" ว่าเป็นตัวพิมพ์เล็กหรือไม่ โดยจะแสดงผลลัพธ์เป็นอักขระ รหัส Unicode ของอักขระ และค่าความจริงว่าเป็นตัวพิมพ์เล็กหรือไม่
*/

func main() {
    s := "Hello how are u"
    for i := 0; i < len(s); i++ {
        var ch rune = rune(s[i])
        fmt.Println("This character", string(ch), " ", ch, "is in lower case", unicode.IsLower(ch))
    }

}
/* 
คำอธิบาย:
- ประกาศตัวแปร `s` เป็นสตริงที่มีค่าเป็น `"Hello how are u"`
- ใช้ลูป `for` เพื่อวนลูปตามความยาวของสตริง `s`
- ในแต่ละรอบของลูป:
    - แปลงอักขระที่ตำแหน่ง `i` ในสตริง `s` เป็น Rune และกำหนดให้กับตัวแปร `ch`
    - ใช้ฟังก์ชัน `fmt.Println()` เพื่อแสดงข้อความ โดยแสดงอักขระในรูปแบบสตริงด้วย `string(ch)`, แสดงรหัส Unicode ของอักขระด้วย `ch`, และแสดงค่าความจริงว่าอักขระเป็นตัวพิมพ์เล็กหรือไม่ด้วย `unicode.IsLower(ch)`

โปรแกรมนี้แสดงการใช้เมธอด IsLower() ของแพ็คเกจ Unicode ในการตรวจสอบว่าแต่ละอักขระในสตริงเป็นตัวพิมพ์เล็กหรือไม่ โดยจะแสดงผลลัพธ์เป็นอักขระ รหัส Unicode ของอักขระ และค่าความจริงว่าเป็นตัวพิมพ์เล็กหรือไม่
*/