package main

import (
	"fmt"
)

/*
ในภาษา Go ตัวดำเนินการเปรียบเทียบ (relational operator) ที่สามารถใช้กับพอยน์เตอร์ได้มีเพียงตัวดำเนินการเท่ากับ (equality operator) เท่านั้น ตัวดำเนินการเท่ากับสามารถใช้เพื่อตรวจสอบว่าพอยน์เตอร์สองตัวชี้ไปที่ที่อยู่หน่วยความจำเดียวกันหรือไม่ ดังแสดงในโปรแกรม 10.8
นอกจากนี้ ตัวดำเนินการเท่ากับ (== หรือ !=) ยังสามารถใช้เพื่อตรวจสอบว่าตัวแปรมีที่อยู่หน่วยความจำหรือเป็นพอยน์เตอร์ nil หรือไม่
*/

func main() {
    x := 15
    y := 15
    
    a := &x
    b := &x
    c := &y
    
    fmt.Println(a == b)  // เปรียบเทียบว่าพอยน์เตอร์ a และ b ชี้ไปที่ที่อยู่เดียวกันหรือไม่
    fmt.Println(a == c)  // เปรียบเทียบว่าพอยน์เตอร์ a และ c ชี้ไปที่ที่อยู่เดียวกันหรือไม่
    
    var d *float64
    fmt.Println(d == nil)  // ตรวจสอบว่าพอยน์เตอร์ d เป็น nil หรือไม่
}
/* 

*/