package main

import "fmt"

/*
ในภาษา Go เราสามารถส่งอาร์กิวเมนต์จำนวนแปรผันให้กับฟังก์ชันได้
*/

func Variable_Arguments(s ...int) {
	fmt.Println(s)                // พิมพ์ค่าของอาร์กิวเมนต์ที่รับเข้ามาทั้งหมด
	fmt.Println(s[0], s[1], s[2]) // พิมพ์ค่าของอาร์กิวเมนต์ตัวที่ 1, 2, และ 3
	fmt.Println(len(s))           // พิมพ์จำนวนอาร์กิวเมนต์ที่รับเข้ามา
}

func main() {
	Variable_Arguments(10, 20, 30) // เรียกใช้ฟังก์ชัน Variable_Arguments โดยส่งอาร์กิวเมนต์ 3 ตัว
}

/*
1. เราประกาศฟังก์ชัน `Variable_Arguments` ที่รับอาร์กิวเมนต์แบบ variadic โดยใช้ `...int` เป็นพารามิเตอร์
   - `...int` หมายถึงฟังก์ชันนี้สามารถรับอาร์กิวเมนต์จำนวนเท่าไหร่ก็ได้ ที่มีชนิดข้อมูลเป็น `int`
2. ภายในฟังก์ชัน `Variable_Arguments` เรามีการใช้งานอาร์กิวเมนต์ที่รับเข้ามาดังนี้
   - `fmt.Println(s)` จะพิมพ์ค่าของอาร์กิวเมนต์ที่รับเข้ามาทั้งหมด ซึ่งจะอยู่ในรูปแบบของ slice
   - `fmt.Println(s[0], s[1], s[2])` จะพิมพ์ค่าของอาร์กิวเมนต์ตัวที่ 1, 2, และ 3 ตามลำดับ
   - `fmt.Println(len(s))` จะพิมพ์จำนวนอาร์กิวเมนต์ที่รับเข้ามา
3. ในฟังก์ชัน `main` เราเรียกใช้ฟังก์ชัน `Variable_Arguments` โดยส่งอาร์กิวเมนต์ 3 ตัว คือ 10, 20, และ 30
*/
