package main

import "fmt"

/*
- สร้างชนิดข้อมูลใหม่ชื่อ `Int` จากชนิด `int`
- สร้างฟังก์ชัน `Add_One` โดยใช้ `*Int` เป็น Receiver เพื่อเพิ่มค่าของตัวแปรชนิด `Int` ขึ้น 1 หน่วย
- ในฟังก์ชัน `main`:
    - ประกาศตัวแปร `a` ชนิด `oops.Int` และกำหนดค่าเริ่มต้นเป็น 10
    - เรียกใช้ฟังก์ชัน `Add_One()` ผ่านตัวแปร `a` เพื่อเพิ่มค่าขึ้นอีก 1 หน่วย
    - แสดงค่า `a` ออกทางหน้าจอ (ได้ผลลัพธ์เป็น 11)
*/

type Int int // กำหนดชนิดข้อมูลใหม่ชื่อ Int จากชนิด int

func (a *Int) Add_One() { // สร้างฟังก์ชัน Add_One โดยใช้ *Int เป็น Receiver
	*a = *a + 1 // เพิ่มค่าของ a ขึ้น 1 ผ่านการใช้ Pointer
}

func main() {
	var a Int = 10 // ประกาศตัวแปร a ชนิด oops.Int และกำหนดค่าเริ่มต้นเป็น 10

	a.Add_One() // เรียกใช้ฟังก์ชัน Add_One ผ่าน a

	fmt.Println(a) // แสดงค่า a ออกทางหน้าจอ
}

/*
การสร้าง Custom Type และ Receiver Function ช่วยจัดระเบียบโค้ดตามหลัก OOP ใน Go ได้ง่ายขึ้น
*/
