package main

import (
	"fmt"
)

/*
วิธีการ Pass by Reference เป็นการส่งค่าโดยการส่งที่อยู่หน่วยความจำ (pointer) ของข้อมูลนั้นเข้าไปในฟังก์ชัน แทนการส่งค่าข้อมูลเอง เมื่อมีการเปลี่ยนแปลงข้อมูลภายในฟังก์ชัน ข้อมูลต้นทางก็จะถูกเปลี่ยนแปลงตามไปด้วย วิธีนี้มีประโยชน์สำหรับการส่งข้อมูลขนาดใหญ่เข้าไปในฟังก์ชัน เนื่องจากไม่ต้องสร้างสำเนาข้อมูลขึ้นมาใหม่ ช่วยประหยัดเวลาและหน่วยความจำได้
*/

// ฟังก์ชัน Add_One_By_Reference รับพารามิเตอร์เป็นพอยเตอร์ชี้ไปที่ตัวแปรประเภท int
func Add_One_By_Reference(ptr *int) {
	// เปลี่ยนแปลงค่าที่ ptr กำลังชี้อยู่ โดยเพิ่มค่าขึ้น 1
	fmt.Println("The value of ptr", ptr) // 0x14000110018
	*ptr = *ptr + 1
}

func main() {
	// กำหนดค่าเริ่มต้นให้ตัวแปร res เท่ากับ 1
	res := 1

	// ส่งที่อยู่หน่วยความจำของ res เข้าไปยังฟังก์ชัน Add_One_By_Reference
	Add_One_By_Reference(&res)

	// แสดงค่าของ res ซึ่งถูกเปลี่ยนแปลงไปหลังจากเรียกใช้ฟังก์ชัน
	fmt.Println("The value of res is not preserved after function execution", res)
}

/*

 */
